{
    "id": "prose-sundara-3",
    "kanda": "sundara",
    "sarga": "3",
    "title": "Hanuman conquers Lanka",
    "chapter": "3",
    "overview": "In this chapter Hanuman faces Lanka, the city of Lanka\r       herself in the form of a demoness.",
    "content": [
        {
            "type": "verse",
            "text": "That Hanuman, best among monkeys, the intellectual son of Vayu, one with great might, \r  stood on the mountain called Lamba with its high peaks equaling a high cloud, gathered courage and \r  entered at night the city of Lanka\r  ruled by Ravana and filled with beautiful forests and places of water such as lakes. The city of \r  Lanka was shone by buildings equaling autumnal clouds. With a sound resembling that \r  of an ocean, it was served by ocean breeze. It was filled with well fed and mighty armies like Vitapati, \r  the capital of Kubera. It had elephants positioned at archways and had white gates and archways. Quickly \r  approaching that city of Lanka which was protected by Rakshasas, like the auspicious city of Bhogavati \r  being protected by serpents moving about, spread with cloud illumined by flashes of lightening, served by \r  pathways of stars, with a light breeze like the Indra's city of Amaravati, surrounded by a wall \r  with a golden hue, decorated by flags with sounds from groups of small bells. He became happy and leapt up \r  the wall."
        },
        {
            "type": "verse",
            "text": "Seeing the city everywhere Hanuman became surprised at heart. Thereafter Hanuman the monkey, \r  became happy seeing the doors which were of golden color, with platforms of cat's eye gems, inlaid with diamonds, \r  crystals and pearls, embellished with floors of gems, graced with elephants made of refined gold, crowned \r  with spotless white silver, stairs studded with cat's eye gems, with inside walls made of crystal free from \r  dust, provided with lovely assembly halls, with sounds of Krauncha birds and peacocks, served by royal \r  swans, looking as though flying toward the sky, with auspicious houses resounding everywhere with the sounds \r  of clarionets and ornaments, equaling the city of Vasvaukasaara, as though flying towards the \r  sky."
        },
        {
            "type": "verse",
            "text": "Seeing that city of Ravana, which was best among \r  cities, a wealthy city, a beautiful and auspicious city, that powerful Hanuman thought thus. \"It is not possible \r  for anyone else to oppose this city, by strength alone, which is being guarded by armies of Ravana with raised \r  weapons. This land may be conquerable by Kumuda or Angada, to the great monkey Sushena or to \r  Mainda or Dvivida. There may be access to this land to the son of Sun God Sugreeva, to the monkey \r  Kusaparvana, to the chief among monkeys Riksha and to me.\" Considering the long armed Sri Rama's \r  strength and Lakshmana's valour, Hanuman became happy."
        },
        {
            "type": "verse",
            "text": "That great monkey saw that city of king of rakshasas like a wealthy woman decorated \r  with diamonds for her clothes, with various storage houses as earrings, with amouries for her breasts. \r  Due to the lamps that illuminated the radiant great houses, all darkness was lost. Thereafter, the guardian \r  of that city, in her own form, saw Hanuman, the best among monkeys and the mighty one, \r  entering. Seeing that best among monkeys Hanuman there, that Lanka ruled by Ravana, \r  rose up herself with a horrific appearance of face an eyes. She stood in front of the best among Vanaras \r  Hanuman. She made a great sound and spoke to Hanuman thus. \"O one who lives in gardens! \r  Who are you? For what reason did you come here? As long as your lives are sustained, tell me the truth here \r  before that. It is indeed not possible for you to enter this city of Lanka\r  which is protected by Ravana's forces and strongly guarded all around.\""
        },
        {
            "type": "verse",
            "text": "Thereafter the mighty Hanuman spoke to Lanka standing in front of Him as follows: \"Whatever \r  matter you are asking me, I will tell you that truthfully. You are standing at the entrance to the city. O \r  one with ugly eyes! Who are you? O horrible one! Stopping me, for what reason are you threatening me? \r  "
        },
        {
            "type": "verse",
            "text": "Listening to Hanuman's words, that Lanka, with ability to achieve desired form, became \r  angry and spoke these strong words to Hanuman. \"I protect this city, being invincible. I wait for the orders \r  of the king of demons Ravana, the great one. After humiliating me it is not possible for you to enter the \r  city. Being beaten by me, you will leave life and have a permanent sleep. O Vanara! I am protecting \r  this city of Lanka in all directions. This matter has been already \r  told to you by me.\""
        },
        {
            "type": "verse",
            "text": "The son of Vayu and best among Vanaras heard Lanka's words and stood up like \r  a second mountain, with a purpose. Thereafter that Hanuman the wise one, with great strength, best among those \r  who can fly and best among Vanaras, saw that city of Lanka in the form of an ugly woman and spoke thus. \r  \"I should like to see the city of Lanka\r  with its palaces, defensive walls and archways. I came here for that reason. I am very curious to see them. \r  My arrival here is indeed to see Lanka's gardens, parks, forests and important houses all over.\""
        },
        {
            "type": "verse",
            "text": "Listening to Hanuman's words, Lanka with the ability to assume desired\r  form, spoke harsh words stronger than before. \"O lowly Vanara with an evil \r  mind! It is not possible for you to see this city ruled by king of rakshasas, without first defeating \r  me.\" "
        },
        {
            "type": "verse",
            "text": "Then that tiger among Vanaras Hanuman spoke to that demon: \"O auspicious one! After seeing \r  this city I will return back again to where I came from.\""
        },
        {
            "type": "verse",
            "text": "Thereafter that Lanka made a great sound causing terror and hit Hanuman, the best among Vanaras, \r  with her palm quickly. Then that tiger among Vanaras, the powerful son of Vayu, \r  being hit powerfully by Lanka made a great sound. Hanuman became dizzy with anger and folded his fingers \r  of left hand. He then hit her with His fist. \"She is a woman\" - thinking thus He did not \r  show much anger by Himself. That demon fell on land immediately by that hit with a distressed body \r  and appeared with a horrific face. Then the intellectual and glorious Hanuman saw her fallen down and thinking \r  her to be woman, showed kindness. Lanka being very gloomy spoke with a flattering tone without pride these \r  words to Hanuman the Vanara. "
        },
        {
            "type": "verse",
            "text": "\"O long armed one! O best among Vanaras! Get propitiated and protect me. O gentle one! \r  Those with great strength and courage always stand firm on tradition. I am myself the city of \r  Lanka. I am defeated by your strength. In earlier times I had been given a boon by \r  Lord Brahma. Hear from me about this matter. Let this be known by you - whenever a Vanara conquers \r  you with his might, then a fear will come for Rakshasas. O gentle one! With \r  your appearance now, that time has come for me. Ordinance of Brahma is the truth and is immutable. The destruction \r  has come for Ravana the evil minded king and to all Rakshasas due to Sita. For that reason, enter \r  the city of Lanka\r  ruled by Ravana and do here whatever tasks you want to. Enter the auspicious city of \r  Lanka stuck by the curse, ruled by the king of Rakshasas, roam everywhere and \r  search for the chaste wife Sita according to your comfort.\""
        }
    ]
}